print("Введите длину и ширину первого треугольниа")
f= int(input())
r= int(input())
print("Введите длину и ширину второго прямоугольника")
h= int(input())
m=int(input())
print("Введите кординаты левого нижнего угла первого прямоугольника(x,y)")
x1=int(input())
y1=int(input())
print("Введите координаты левого нижнего угла второго прямоугольника(x,y)")
x2= int(input())
y2= int(input())
if (f>0 and r>0) and (h>0 and m>0) and (f!= h and r!=m):
    # Работа внутри первого прямоугольника
  p1 = (int(x1))+0
  l1 = (int(y1)) + (int(r))
  j1 =(int(p1)) + (int(f))
  u1 = (int(l1)) + 0
  r1 = (int(x1)) + (int(f))
  b1 = (int(y1)) + 0
    # Работа внутри второго прямоугольника
  p2 = (int(x2)) + 0
  l2 = (int(y2)) + (int(m))
  j2 = (int(p2)) + (int(h))
  u2 = (int(l2)) +0
  r2 = (int(x2)) + (int(h))
  b2 = (int(y2)) + 0
  print("Первый прямоугольник:")
  print("Левый нижний - ",x1,',', y1,"\n"
      ,"Левый верхний угол - ", p1, ",", l1, "\n",
      "Правый нижний угол - ", r1, ",", b1, "\n",
      "Правый верхний угол - ", j1, ",", u1, sep = '')
  print("Второй прямоугольник:")
  print("Левый нижний - ",x2,',', y2,"\n"
      ,"Левый верхний угол - ", p2, ",", l2, "\n",
      "Правый нижний угол - ", r2, ",", b2, "\n",
      "Правый верхний угол - ", j2, ",", u2, sep = '')
else :
    print("Ты хоть понял, что прямо сейчас ты вывернул прямоугольник?")




